onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДЗ_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.ДЗ_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДЗ_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++Калашников ДЗ-Нетология 03.06.2025 Добавить реквизит (ДЗ_КонтактноеЛицо)
	
	ЭлементКонтактноеЛицо = Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"),Элементы.ГруппаШапкаПраво);
	ЭлементКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;  
	ЭлементКОнтактноеЛицо.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
	//--
	
	//++Калашников ДЗ-Нетология 03.06.2025 Добавить ОбычнуюГруппу ( ГруппаСкидкаИПерерасчет) 
	 
	ГруппаСкидкаИПерерасчет = Элементы.Добавить("СкидкаИПерерасчет",Тип("ГруппаФормы"),Элементы.ГруппаШапкаЛево); 
	ГруппаСкидкаИПерерасчет.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидкаИПерерасчет.ОтображатьЗаголовок = Ложь;
    ГруппаСкидкаИПерерасчет.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	 
	//--
	
	//++Калашников ДЗ-Нетология 03.06.2025 Добавить реквизит (ДЗ_СогласованнаяCкидка)

	ЭлементСогласованнаяСкидка = Элементы.Вставить("СогласованнаяСкидка",Тип("ПолеФормы"),ГруппаСкидкаИПерерасчет);
	ЭлементСогласованнаяСкидка.Вид = ВидПоляФормы.ПолеВвода;  
	ЭлементСогласованнаяСкидка.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка";
	ЭлементСогласованнаяСкидка.УстановитьДействие("ПриИзменении","СогласованнаяСкидкаПриИзменении");
	//--
	
	 //++Калашников ДЗ-Нетология 03.06.2025 Добавить Команду( ДЗ_ПересчитатьТаблицу) 
	
	ДЗ_ПересчитатьТаблицу = Команды.Добавить("ДЗ_ПересчитатьТаблицу"); //Имя команды
	ДЗ_ПересчитатьТаблицу.Заголовок = "Пересчитать Таблицу";
	ДЗ_ПересчитатьТаблицу.Действие  = "КомандаПересчитатьТаблицу";
	
	//--
	
	//++Калашников ДЗ-Нетология 03.06.2025 Добавить КнопкуФормы (ПересчитатьТаблицу) 
	 
	КнопкаФормы = Элементы.Добавить("КнопкаПересчитатьТаблицу",Тип("КнопкаФормы"),ГруппаСкидкаИПерерасчет); 
    КнопкаФормы.ИмяКоманды = "ДЗ_ПересчитатьТаблицу";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
	КнопкаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КнопкаФОрмы.Картинка = БиблиотекаКартинок.Обновить; 
	
	 //-- 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура СогласованнаяСкидкаПриИзменении(Элемент) 
	
	//++Калашников ДЗ-Нетология 10.04.2025 Событие "ПриИзменении" для реквизита (ДЗ_СогласованнаяCкидка)
	
	Если Объект.Товары.Количество() > 0 ИЛИ Объект.Услуги.Количество() > 0 Тогда
		ВопросОСкидке();
	КонецЕсли;
	
	//--
	
КонецПроцедуры 

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Процедура ВопросОСкидке() 
	
	//++Калашников ДЗ-Нетология 03.06.2025 добавлен вопрос о применение скидки	
	Ответ = Ждать ВопросАсинх("Изменен процент скидки. Пересчитать таблицу товаров и услуг?",РежимДиалогаВопрос.ДаНет);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		РассчитатьСтрокиТаблицСУчетомСкидки();
	Иначе
		
	КонецЕсли;
	
	//--

КонецПроцедуры 

&НаКлиенте
Процедура КомандаПересчитатьТаблицу(Команда) 
	
	//++Калашников ДЗ-Нетология 03.06.2025 добавлено действие для команды Перерсчитать таблицы
	
	РассчитатьСтрокиТаблицСУчетомСкидки();
	
	//--
	
КонецПроцедуры  

&НаКлиенте
Процедура РассчитатьСтрокиТаблицСУчетомСкидки()
	
	//++Калашников ДЗ-Нетология 03.06.2025 добавлен метод перерасчета таблицы
	
	Для Каждого Строка Из Объект.Товары Цикл
		
		РассчитатьСуммуСтроки(Строка) 
		
	КонецЦикла; 
	
	Для Каждого Строка Из Объект.Услуги Цикл
		
		РассчитатьСуммуСтроки(Строка) 
		
	КонецЦикла; 
	
	РассчитатьСуммуДокумента(); 
	
	//--
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные) 
	
	//++Калашников ДЗ-Нетология 03.06.2025 В КоэффициентСкидки нужно учитывать Скидку Товара или Услуги + общую Согласованную Скидку 
    //Старый код
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100; 
	
	КоэффициентСкидки = 1 - (ТекущиеДанные.Скидка + Объект.ДЗ_СогласованнаяСкидка) / 100;
	
    Если КоэффициентСкидки < 0 Тогда
		КоэффициентСкидки = 0;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон("Так как суммарный размер скидки %1 %% ,а это больше 100 %%, скидка уменьшена до максимального возможного значения в 100 %%",ТекущиеДанные.Скидка + Объект.ДЗ_СогласованнаяCкидка);
		Сообщение.Сообщить();
	КонецЕсли;

	//--
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
